adrianbica/BLE_thpsensor_RX23W/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: R_CMT_Stop
***********************************************************************************************************************//**
* @brief Stops a CMT channel and powers down the CMT unit if possible
* @param[in] channel The CMT timer channel to stop\n
* @retval true  Successful; CMT closed\n
* @retval false     Invalid settings \n
* @details This function frees the CMT channel by clearing its assignment and disabling the associated interrupt.
* The CMT channel cannot be used again until it has been reopened with either the R_CMT_CreatePeriodic or the R_CMT_CreateOneShot function.
* If the CMT channel is already used as RTOS system timer, a call to this function with this CMT channel as channel,
* will result in FALSE being returned
*/
bool R_CMT_Stop (uint32_t channel)
{
    /* Make sure valid channel number was input. */
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
    if (channel >= CMT_RX_NUM_CHANNELS)
#elif BSP_CFG_RTOS_USED == 1        /* FreeRTOS */
    if ((channel >= CMT_RX_NUM_CHANNELS) || (BSP_CFG_RTOS_SYSTEM_TIMER == channel))
//#elif BSP_CFG_RTOS_USED == 2  /* SEGGER embOS */
//#elif BSP_CFG_RTOS_USED == 3  /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED   == 4  /* Renesas RI600V4 & RI600PX */
    if ((channel >= CMT_RX_NUM_CHANNELS) || (BSP_CFG_RTOS_SYSTEM_TIMER == channel) || (_RI_TRACE_TIMER == channel))
#else /* Non-OS & others */
    if (channel >= CMT_RX_NUM_CHANNELS)
#endif/* BSP_CFG_RTOS_USED */
    {
        /* Invalid channel number was used. */
        return false;
    }

    /* Stop counter. */
    cmt_counter_stop(channel);

    /* Turn off power to channel. */
    power_off(channel);

    /* Set mode to disabled. */
    g_cmt_modes[channel] = CMT_RX_MODE_DISABLED;

    /* Set channel as available. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMT0 + channel));

    return true;
} /* End of function R_CMT_Stop */

/***********************************************************************************************************************
* Function Name: R_CMT_Control
***********************************************************************************************************************//**
* @brief This function provides various ways to control and monitor a CMT channel
* @param[in] channel CMT channel number to control.\n
* @param[in] command Command to execute:\n
* CMT_RX_CMD_IS_CHANNEL_COUNTING\n
* CMT_RX_CMD_PAUSE\n
* CMT_RX_CMD_RESUME\n
* CMT_RX_CMD_RESTART\n
* CMT_RX_CMD_GET_NUM_CHANNELS\n
* CMT_RX_CMD_SET_PRIORITY\n
* CMT_RX_CMD_GET_PRIORITY\n
* @param[in] *pdata
* @retval true  The command completed properly. Check pdata
* @retval false     The command did not complete properly
* @details This function provides a number of commands:\n
* CMT_RX_CMD_IS_CHANNEL_COUNTING tells if a CMT channel is currently running.  Check *pdata.\n
* CMT_RX_CMD_PAUSE pauses a timer without closing it (without powering it off).\n
* CMT_RX_CMD_RESUME restarts a paused timer without resetting the counter to zero\n
* CMT_RX_CMD_RESTART restarts a paused timer after resetting the counter to zero\n
* CMT_RX_CMD_GET_NUM_CHANNELS returns the total number of channels available\n
* CMT_RX_CMD_SET_PRIORITY sets the interrupt priority of the CMT channel.\n
* CMT_RX_CMD_GET_PRIORITY gets the interrupt priority of the CMT channel.\n
* If the CMT channel is already used as RTOS system timer, a call to this function with this CMT channel as channel,
* and any of CMT_RX_CMD_IS_CHANNEL_COUNTING, CMT_RX_CMD_PAUSE,
* CMT_RX_CMD_RESUME, CMT_RX_CMD_RESTART as command, will result in FALSE being returned.
*/
bool R_CMT_Control (uint32_t channel, cmt_commands_t command, void * pdata)
{
    bool ret = true;
    cmt_priority_t priority;

#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
    if (CMT_RX_CMD_GET_NUM_CHANNELS == command)
    {
        /* Return the number of CMT channels on this MCU. */
        *(uint32_t *)pdata = CMT_RX_NUM_CHANNELS;
        ret = true;
        return ret;
    }
    else if ((channel == BSP_CFG_RTOS_SYSTEM_TIMER) || (channel >= CMT_RX_NUM_CHANNELS))
    {
        /* Specified CMT channel is being used by RTOS or Invalid channel */
        /* Modifying is NOT allowed for the other commands. */
        ret = false;
        return ret;
    }
    else
    {
        /* Do nothing. */
    }
//#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
//#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */

    if (CMT_RX_CMD_GET_NUM_CHANNELS == command)
    {
        /* Return the number of CMT channels on this MCU. */
        *(uint32_t *)pdata = CMT_RX_NUM_CHANNELS;
        ret = true;
        return ret;
    }
    else if ((channel == BSP_CFG_RTOS_SYSTEM_TIMER) || (channel == _RI_TRACE_TIMER) || (channel >= CMT_RX_NUM_CHANNELS))
    {
        /* Specified CMT channel is being used by RTOS or Invalid channel */
        /* Modifying is NOT allowed for the other commands. */
        ret = false;
        return ret;
    }
    else
    {
        /* Do nothing. */
    }
#else /* Non-OS & others */
#endif/* BSP_CFG_RTOS_USED */

    /* Process command that was input. */
    switch (command)
    {
        case CMT_RX_CMD_IS_CHANNEL_COUNTING:
        {
            /* Check input channel. */
            if (channel < CMT_RX_NUM_CHANNELS)
            {
                /* Valid channel input. Is this channel currently counting? */
                if (CMT_RX_MODE_DISABLED == g_cmt_modes[channel])
                {
                    /* pdata = false*/
                    *(bool *)pdata = false;
                }
                else
                {
                    /* pdata = true*/
                    *(bool *)pdata = true;
                }
            }
            else
            {
                ret = false;
            }
            break;
        }
#if BSP_CFG_RTOS_USED == 0   /*Unreachable code because of checksabove*/
        case CMT_RX_CMD_GET_NUM_CHANNELS:
        {
            /* number of CMT channels */
            *(uint32_t *)pdata = CMT_RX_NUM_CHANNELS;
            break;
        }
#endif
        case CMT_RX_CMD_PAUSE:
        {
            if (channel < CMT_RX_NUM_CHANNELS)
            {
                /* Valid channel input. Is this channel currently counting? */
                if (CMT_RX_MODE_DISABLED != g_cmt_modes[channel])
                {

